------------------------------------------------------------------------------------------------------------
                                        	-----Mane-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
	#SingleInstance, Force
	#NoTrayIcon
	#NoEnv
	SetWorkingDir %A_ScriptDir%
	#MaxHotkeysPerInterval
	#HotkeyInterval
	#KeyHistory 0
;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                        -----Mane Ini KEY-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	IniRead, key1, Settings.ini, KeySetup, KEY1
; мигрировано ;	IniRead, key3, Settings.ini, KeySetup, KEY3
; мигрировано ;	IniRead, key4, Settings.ini, KeySetup, KEY4
; мигрировано ;	IniRead, key5, Settings.ini, KeySetup, KEY5
; мигрировано ;	IniRead, key6, Settings.ini, KeySetup, KEY6
; мигрировано ;	IniRead, key7, Settings.ini, KeySetup, KEY7
; мигрировано ;	IniRead, key8, Settings.ini, KeySetup, KEY8
; мигрировано ;	IniRead, key9, Settings.ini, KeySetup, KEY9
; мигрировано ;	IniRead, key10, Settings.ini, KeySetup, KEY10
; мигрировано ;	IniRead, key11, Settings.ini, KeySetup, KEY11
; мигрировано ;	IniRead, key12, Settings.ini, KeySetup, KEY12
; мигрировано ;	IniRead, key13, Settings.ini, KeySetup, KEY13
; мигрировано ;	IniRead, key14, Settings.ini, KeySetup, KEY14
; мигрировано ;	IniRead, key15, Settings.ini, KeySetup, KEY15
; мигрировано ;	IniRead, key16, Settings.ini, KeySetup, KEY16
; мигрировано ;	IniRead, key17, Settings.ini, KeySetup, KEY17
; мигрировано ;	IniRead, key18, Settings.ini, KeySetup, KEY18
; мигрировано ;	IniRead, key19, Settings.ini, KeySetup, KEY19
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                        -----Mane Ini Radial-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	IniRead, Radio1Rez, Settings.ini, Resolution, 1920x1080
; мигрировано ;	IniRead, Radio2Rez, Settings.ini, Resolution, 1680x1050
; мигрировано ;	IniRead, Radio3Rez, Settings.ini, Resolution, 1440x900
; мигрировано ;	IniRead, Radio4Rez, Settings.ini, Resolution, 1280x1024
; мигрировано ;	IniRead, Radio5Rez, Settings.ini, Resolution, 1280x720
; мигрировано ;	IniRead, Radio6Rez, Settings.ini, Resolution, 1920x1920
; мигрировано ;	IniRead, Radio1Gen, Settings.ini, Gender, Мужской 
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                    -----Mane Ini Peref-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	IniRead, sTime, Settings.ini, timestamp, sTime
; мигрировано ;;===================================================================================
; мигрировано ;	IniRead, cX, Settings.ini, cord, cX
; мигрировано ;	IniRead, cY, Settings.ini, cord, cY
; мигрировано ;	IniRead, c2Y, Settings.ini, cord, c2Y
; мигрировано ;;===================================================================================
; мигрировано ;	IniRead, mMir1, Settings.ini, Miranda, mMir1
; мигрировано ;	IniRead, mMir2, Settings.ini, Miranda, mMir2
; мигрировано ;	IniRead, mMir3, Settings.ini, Miranda, mMir3
; мигрировано ;	IniRead, mMir4, Settings.ini, Miranda, mMir4
; мигрировано ;	IniRead, mMir5, Settings.ini, Miranda, mMir5
; мигрировано ;;===================================================================================
; мигрировано ;	IniRead, bSteal1, Settings.ini, Steal, bSteal1
; мигрировано ;	IniRead, bSteal2, Settings.ini, Steal, bSteal2
; мигрировано ;;===================================================================================
; мигрировано ;	IniRead, rColor1, Settings.ini, Color, rColor1
; мигрировано ;	IniRead, rColor2, Settings.ini, Color, rColor2
; мигрировано ;;===================================================================================
; мигрировано ;	IniRead, gbadge, Settings.ini, Badge, gbadge
; мигрировано ;;===================================================================================
; мигрировано ;	IniRead, qfrac, Settings.ini, Personal, qfrac
; мигрировано ;	IniRead, wTel, Settings.ini, Personal, wTel
; мигрировано ;	IniRead, vdis, Settings.ini, Personal, vdis
; мигрировано ;	 if vdis=ERROR
; мигрировано ;	{
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                    -----Предустановка-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	IniWrite, LSPD, Settings.ini, Personal, qfrac
; мигрировано ;;===================================================================================
; мигрировано ;	IniWrite, На груди висит бейджик: [LSPD |  CPD | Thomas Zakonov | 102340], Settings.ini, Badge, gbadge
; мигрировано ;;===================================================================================
; мигрировано ;	IniWrite, 123-123-123, Settings.ini, Personal, wTel
; мигрировано ;;===================================================================================
; мигрировано ;	IniWrite, yashiza.s.bekonom@disc.com, Settings.ini, Personal, vdis
; мигрировано ;;===================================================================================
; мигрировано ;	IniWrite, 1000, Settings.ini, timestamp, sTime
; мигрировано ;;===================================================================================
; мигрировано ;	IniWrite, 0, Settings.ini, cord, cX
; мигрировано ;	IniWrite, 0, Settings.ini, cord, cY
; мигрировано ;	IniWrite, 530, Settings.ini, cord, c2Y
; мигрировано ;;===================================================================================
; мигрировано ;	IniWrite, 750, Settings.ini, Steal, bSteal1
; мигрировано ;	IniWrite, 45, Settings.ini, Steal, bSteal2
; мигрировано ;;===================================================================================
; мигрировано ;	IniWrite, Yellow, Settings.ini, Color, rColor1
; мигрировано ;	IniWrite, White, Settings.ini, Color, rColor2
; мигрировано ;;===================================================================================
; мигрировано ;	IniWrite, 1. Вы имеете право хранить молчание., Settings.ini, Miranda, mMir1
; мигрировано ;	IniWrite, 2. Все что Вы скажите может и будет использовано против Вас., Settings.ini, Miranda, mMir2
; мигрировано ;	IniWrite, 3. Вы имеете право на пользование услугами адвоката., Settings.ini, Miranda, mMir3
; мигрировано ;	IniWrite, 4. Если вы не можете оплатить услуги адвоката он будет предоставлен вам государством бесплатно., Settings.ini, Miranda, mMir4
; мигрировано ;	IniWrite, 5. Вы имеете право на пользование личным мобильным телефоном длительностью до 3 минут., Settings.ini, Miranda, mMir5
; мигрировано ;;===================================================================================
; мигрировано ;	IniWrite, 1, Settings.ini, Gender, Мужской
; мигрировано ;	IniWrite, Tab, Settings.ini, KeySetup, key4
; мигрировано ;		reload
; мигрировано ;;===================================================================================
; мигрировано ;	}
; мигрировано ;;===================================================================================
------------------------------------------------------------------------------------------------------------
                                    -----Mane KEY-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
	Hotkey, %KEY1%, Off, UseErrorLevel
	Hotkey, %KEY1%, rel, On, UseErrorLevel
	Hotkey, %KEY3%, Off, UseErrorLevel
	Hotkey, %KEY3%, Mira, On, UseErrorLevel
	Hotkey, %KEY4%, Off, UseErrorLevel
	Hotkey, %KEY4%, Inventory, On, UseErrorLevel
	Hotkey, %KEY5%, Off, UseErrorLevel
	Hotkey, %KEY5%, qBadge, On, UseErrorLevel
	Hotkey, %KEY6%, Off, UseErrorLevel
	Hotkey, %KEY6%, Mega1, On, UseErrorLevel
	Hotkey, %KEY7%, Off, UseErrorLevel
	Hotkey, %KEY7%, Mega2, On, UseErrorLevel
	Hotkey, %KEY8%, Off, UseErrorLevel
	Hotkey, %KEY8%, Geo, On, UseErrorLevel
	Hotkey, %KEY9%, Off, UseErrorLevel
	Hotkey, %KEY9%, CODE1, On, UseErrorLevel
	Hotkey, %KEY10%, Off, UseErrorLevel
	Hotkey, %KEY10%, CODE0, On, UseErrorLevel
	Hotkey, %KEY11%, Off, UseErrorLevel
	Hotkey, %KEY11%, CODE7, On, UseErrorLevel
	Hotkey, %KEY12%, Off, UseErrorLevel
	Hotkey, %KEY12%, CODE6, On, UseErrorLevel
	Hotkey, %KEY13%, Off, UseErrorLevel
	Hotkey, %KEY13%, Cam, On, UseErrorLevel
	Hotkey, %KEY14%, Off, UseErrorLevel
	Hotkey, %KEY14%, CamAC, On, UseErrorLevel
	Hotkey, %KEY15%, Off, UseErrorLevel
	Hotkey, %KEY15%, Signl, On, UseErrorLevel
	Hotkey, %KEY16%, Off, UseErrorLevel
	Hotkey, %KEY16%, steal, On, UseErrorLevel
	Hotkey, %KEY17%, Off, UseErrorLevel
	Hotkey, %KEY17%, Badgeq, On, UseErrorLevel
	Hotkey, %KEY18%, Off, UseErrorLevel
	Hotkey, %KEY18%, Arm, On, UseErrorLevel
	Hotkey, %KEY19%, Off, UseErrorLevel
	Hotkey, %KEY19%, Help, On, UseErrorLevel
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                    	  		-----Mane GUI-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	Gui, 2: -MaximizeBox 
; мигрировано ;	Gui, 2: Show, w595 h505, 𝐌𝐚𝐣𝐞𝐬𝐭𝐢𝐜 𝐇𝐞𝐥𝐩𝐞𝐫
; мигрировано ;	Gui, 2: Color, 000000
; мигрировано ;	Gui, 2: Font, c0xFFFFFF
; мигрировано ;			Gui, 2: Add, Text, x155 y10 w120 h20 +0x200 +Border +0x1, 𝐇𝐨𝐭𝐤𝐞𝐲𝐬 
; мигрировано ;		Gui, 2: Add, Text, x375 y10 w138 h20 +0x200 +Border +0x1, 𝐏𝐞𝐫𝐬𝐨𝐧𝐚𝐥𝐢𝐳𝐚𝐭𝐢𝐨𝐧
; мигрировано ;	Gui, 2: Add, Text, x155 y480 w190 h20 +0x200 +Border +0x1, 𝐌𝐚𝐣𝐞𝐬𝐭𝐢𝐜 𝐇𝐞𝐥𝐩𝐞𝐫 𝐛𝐲 𝐊𝐢𝐜𝐤𝐋𝐨𝐬
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                    	  		-----Картинка-----
; мигрировано ;------------------------------------------------------------------------------------------------------------ 
; мигрировано ;;===================================================================================
; мигрировано ;	Gui, 2: Add, Picture, x365 y205 w215 h300, %A_ScriptDir%\img\back.png	
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                    		-----Левый верхний-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	Gui, 2: Add, Button, x10 y10 w113 h27 gManu, ИНФОРМАЦИЯ
; мигрировано ;	Gui, 2: Add, Button, x10 y45 w113 h27 gHotKey, БИНДЫ
; мигрировано ;	Gui, 2: Add, Button, x10 y80 w113 h27 gInfo1, КОМАНДЫ
; мигрировано ;	Gui, 2: Add, Button, x10 y115 w113 h27 gCom, СОКРАЩЕНИЯ
; мигрировано ;	Gui, 2: Add, Button, x10 y150 w113 h27 gMir, МИРАНДА
	
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                    		-----Левый нижний-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	Gui, 2: Add, Button, x10 y415 w113 h25 gSaveData, 𝐒𝐀𝐕𝐄
; мигрировано ;	Gui, 2: Add, Button, x10 y445 w113 h25 grelog, 𝐑𝐄𝐋𝐎𝐀𝐃
; мигрировано ;	Gui, 2: Add, Button, x10 y475 w113 h25 gexit, 𝐄𝐗𝐈𝐓
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                    	  -----Правый блок кнопок-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	Gui, 2: Add, Button, x300 y38 w138 h25 gbadge, 𝐁𝐀𝐃𝐆𝐄
; мигрировано ;	Gui, 2: Add, Button, x445 y38 w138 h25 gpersona, 𝐕𝐈𝐒𝐈𝐓𝐈𝐍𝐆 𝐂𝐀𝐑𝐃
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                    	-----GUI HotKey-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	Gui, 2: Add, Hotkey, x156 y40 w48 h21 vHot1, %KEY1%
; мигрировано ;	Gui, 2: Add, Hotkey, x156 y65 w48 h21 vHot3, %KEY3%
; мигрировано ;	Gui, 2: Add, Hotkey, x156 y90 w48 h21 vHot5, %KEY5%
; мигрировано ;	Gui, 2: Add, Hotkey, x156 y115 w48 h21 vHot9, %KEY9%
; мигрировано ;	Gui, 2: Add, Hotkey, x156 y140 w48 h21 vHot10, %KEY10%
; мигрировано ;	Gui, 2: Add, Hotkey, x156 y165 w48 h21 vHot11, %KEY11%
; мигрировано ;	Gui, 2: Add, Hotkey, x156 y190 w48 h21 vHot12, %KEY12%
; мигрировано ;	Gui, 2: Add, Hotkey, x156 y215 w48 h21 vHot17, %KEY17%
; мигрировано ;	Gui, 2: Add, Hotkey, x156 y240 w48 h21 vHot18, %KEY18%
; мигрировано ;	Gui, 2: Add, Hotkey, x156 y265 w48 h21 vHot19, %KEY19%
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                	-----GUI Расшифровок-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	Gui, 2: Add, Text, x213 y43 w70 h14 +0x200, 𝐑𝐄𝐋𝐎𝐆
; мигрировано ;	Gui, 2: Add, Text, x213 y68 w70 h14 +0x200, 𝐌𝐈𝐑𝐀𝐍𝐃𝐀
; мигрировано ;	Gui, 2: Add, Text, x213 y93 w60 h14 +0x200, 𝐁𝐀𝐃𝐆𝐄
; мигрировано ;	Gui, 2: Add, Text, x213 y118 w70 h14 +0x200, 𝐂𝐎𝐃𝐄-𝟏
; мигрировано ;	Gui, 2: Add, Text, x213 y143 w70 h14 +0x200, 𝐂𝐎𝐃𝐄-𝟎
; мигрировано ;	Gui, 2: Add, Text, x213 y168 w70 h14 +0x200, 𝐂𝐎𝐃𝐄-𝟕
; мигрировано ;	Gui, 2: Add, Text, x213 y193 w70 h14 +0x200, 𝐂𝐎𝐃𝐄-𝟔
; мигрировано ;	Gui, 2: Add, Text, x213 y218 w70 h14 +0x200, 𝐁𝐀𝐃𝐆𝐄 (𝐐)
; мигрировано ;	Gui, 2: Add, Text, x213 y243 w70 h14 +0x200, 𝐀𝐑𝐌𝐎𝐑
; мигрировано ;	Gui, 2: Add, Text, x213 y268 w70 h14 +0x200, Памятка
; мигрировано ;;===================================================================================
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;                                	-----Radial Расшифровка-----
; мигрировано ;------------------------------------------------------------------------------------------------------------
; мигрировано ;;===================================================================================
; мигрировано ;	Gui, 2: Add, Text, x381 y75 w125 h20 +0x200 +Border +0x1, 𝐑𝐞𝐬𝐨𝐥𝐮𝐭𝐢𝐨𝐧
; мигрировано ;		Gui, 2: Add, Radio, x320 y105 w80 h15 Group vRadio1Rez Checked%Radio1Rez%, 𝟏𝟗𝟐𝟎𝐱𝟏𝟎𝟖𝟎
; мигрировано ;		Gui, 2: Add, Radio, x415 y105 w80 h15 vRadio2Rez Checked%Radio2Rez%, 𝟏𝟔𝟖𝟎𝐱𝟏𝟎𝟓𝟎
; мигрировано ;		Gui, 2: Add, Radio, x510 y105 w80 h15 vRadio3Rez Checked%Radio3Rez%, 𝟏𝟒𝟒𝟎𝐱𝟗𝟎𝟎
; мигрировано ;		Gui, 2: Add, Radio, x320 y130 w80 h15 vRadio4Rez Checked%Radio4Rez%, 𝟏𝟐𝟖𝟎𝐱𝟏𝟎𝟐𝟒
; мигрировано ;		Gui, 2: Add, Radio, x415 y130 w80 h15 vRadio5Rez Checked%Radio5Rez%, 𝟏𝟐𝟖𝟎𝐱𝟕𝟐𝟎
; мигрировано ;		Gui, 2: Add, Radio, x510 y130 w80 h15 vRadio6Rez Checked%Radio6Rez%, 𝟏𝟗𝟐𝟎𝐱𝟏𝟗𝟐𝟎
;=================================================================================== 
------------------------------------------------------------------------------------------------------------
                                    	  		-----Файлы-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
		IfnotExist, %A_ScriptDir%\img
	{
		FileCreateDir, %A_ScriptDir%\img
	}
	URLDownloadToFile, https://i.ibb.co/YLDKGRw/back.png,%A_ScriptDir%\img\back.png
		return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                	-----GUI Переферия-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
		WinSet_Click_Through(I, T="254") {
			IfWinExist, % "ahk_id " I
	{
		If (T == "Off")
	{
		WinSet, AlwaysOnTop, Off, % "ahk_id " I
		WinSet, Transparent, Off, % "ahk_id " I
		WinSet, ExStyle, -0x20, % "ahk_id " I
	}
		Else
	{
		WinSet, AlwaysOnTop, On, % "ahk_id " I
			If(T < 0 || T > 254 || T == "On")
			T := 254
		WinSet, Transparent, % T, % "ahk_id " I
		WinSet, ExStyle, +0x20, % "ahk_id " I
	}
	}
		Else
		Return 0
	}
		return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                	-----ManeSaveData-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
	SaveData:
		Gui, Submit, NoHide
		  	IniWrite, %Radio1Rez%, Settings.ini, Resolution, 1920x1080
			IniWrite, %Radio2Rez%, Settings.ini, Resolution, 1680x1050
			IniWrite, %Radio3Rez%, Settings.ini, Resolution, 1440x900
			IniWrite, %Radio4Rez%, Settings.ini, Resolution, 1280x1024
			IniWrite, %Radio5Rez%, Settings.ini, Resolution, 1280x720
			IniWrite, %Radio6Rez%, Settings.ini, Resolution, 1920x1920
			IniWrite, 1, Settings.ini, Gender, Мужской

			IniWrite, %Hot1%, Settings.ini, KeySetup, KEY1
			IniWrite, %Hot3%, Settings.ini, KeySetup, KEY3
			IniWrite, %Hot4%, Settings.ini, KeySetup, KEY4
			IniWrite, %Hot5%, Settings.ini, KeySetup, KEY5
			IniWrite, %Hot6%, Settings.ini, KeySetup, KEY6
			IniWrite, %Hot7%, Settings.ini, KeySetup, KEY7
			IniWrite, %Hot8%, Settings.ini, KeySetup, KEY8
			IniWrite, %Hot9%, Settings.ini, KeySetup, KEY9
			IniWrite, %Hot10%, Settings.ini, KeySetup, KEY10
			IniWrite, %Hot11%, Settings.ini, KeySetup, KEY11
			IniWrite, %Hot12%, Settings.ini, KeySetup, KEY12
			IniWrite, %Hot13%, Settings.ini, KeySetup, KEY13
			IniWrite, %Hot14%, Settings.ini, KeySetup, KEY14
			IniWrite, %Hot15%, Settings.ini, KeySetup, KEY15
			IniWrite, %Hot16%, Settings.ini, KeySetup, KEY16
			IniWrite, %Hot17%, Settings.ini, KeySetup, KEY17
			IniWrite, %Hot18%, Settings.ini, KeySetup, KEY18
			IniWrite, %Hot19%, Settings.ini, KeySetup, KEY19
			MsgBox, 0, SAVE, Данные сохранены.
		Reload
		return
;===================================================================================
	SaveData1:
		Gui, 3: Submit, NoHide
			IniWrite, %vdis%, Settings.ini, Personal, vdis
			IniWrite, %qfrac%, Settings.ini, Personal, qfrac
			IniWrite, %wTel%, Settings.ini, Personal, wTel
			MsgBox, 0, SAVE, Данные сохранены.
		Reload
		return
;===================================================================================
	SaveData2:
		Gui, 4: Submit, NoHide
			IniWrite, %cX%, Settings.ini, cord, cX
		Reload
		return
;===================================================================================
	SaveData3:
		Gui, 5: Submit, NoHide
			IniWrite, %cY%, Settings.ini, cord, cY
			IniWrite, %c2Y%, Settings.ini, cord, c2Y
		Reload
		return
;===================================================================================
	SaveData4:
		Gui, 6: Submit, NoHide
			IniWrite, %sTime%, Settings.ini, timestamp, sTime
		Reload
		return
;===================================================================================
	SaveData5:
		Gui, 7: Submit, NoHide
			IniWrite, %mMir1%, Settings.ini, Miranda, mMir1
			IniWrite, %mMir2%, Settings.ini, Miranda, mMir2
			IniWrite, %mMir3%, Settings.ini, Miranda, mMir3
			IniWrite, %mMir4%, Settings.ini, Miranda, mMir4
			IniWrite, %mMir5%, Settings.ini, Miranda, mMir5
			MsgBox, 0, SAVE, Данные сохранены.
		Reload
		return
;===================================================================================
	SaveData6:
		Gui, 8: Submit, NoHide
			IniWrite, %bSteal1%, Settings.ini, Steal, bSteal1
			IniWrite, %bSteal2%, Settings.ini, Steal, bSteal2
		Reload
		return
;===================================================================================
	SaveData7:
		Gui, 10: Submit, NoHide
			IniWrite, %rColor1%, Settings.ini, Color, rColor1
			IniWrite, %rColor2%, Settings.ini, Color, rColor2
		Reload
		return
;=================================================================================== 
	SaveData8:
		Gui, 14: Submit, NoHide
			IniWrite, %gbadge%, Settings.ini, Badge, gbadge
			MsgBox, 0, SAVE, Данные сохранены.
		Reload
		return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                        -----Gui-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
			Arm:
		if (Radio1Rez==1)
	{
	sendinput, {i}
		sleep, 90
	MouseMove, 1410, 405
		sleep, 20
	MouseClick, Right
			
		sleep, 20
	MouseMove, 1485, 425
		sleep, 10
	MouseClick, Left
		sleep, 20
	sendinput, {Esc}
	}
		else if (Radio2Rez==1)
	{
	sendinput, {i}
		sleep, 50
	MouseMove, 1275, 405
		sleep, 20
	MouseClick, Right
			
		sleep, 20
	MouseMove, 1360, 430
		sleep, 10
	MouseClick, Left
		sleep, 20
	sendinput, {Esc}
	}
		else if (RadioRez3==1)
	{
	sendinput, {i}
		sleep, 50
	MouseMove, 1095, 345
		sleep, 20
	MouseClick, Right
			
		sleep, 20
	MouseMove, 1170, 370
		sleep, 10
	MouseClick, Left
		sleep, 20
	sendinput, {Esc}
	}
		else if (Radio4Rez==1)
	{
	sendinput, {i}
		sleep, 50
	MouseMove, 1000, 415
		sleep, 20
	MouseClick, Right
			
		sleep, 20
	MouseMove, 1015, 445
		sleep, 10
	MouseClick, Left
		sleep, 20
	sendinput, {Esc}
	}
		else if (Radio5Rez==1)
	{
	sendinput, {i}
		sleep, 50
	MouseMove, 935, 280
		sleep, 20
	MouseClick, Right
			
		sleep, 20
	MouseMove, 1000, 295
		sleep, 10
	MouseClick, Left
		sleep, 20
	sendinput, {Esc}
	}
		else if (Radio6Rez==1)
	{
	sendinput, {i}
		sleep, 50
	MouseMove, 830, 300
		sleep, 20
	MouseClick, Right
			
		sleep, 20
	MouseMove, 885, 320
		sleep, 10
	MouseClick, Left
		sleep, 20
	sendinput, {Esc}
	}
		else 
	{ 
    MsgBox, 16, Ошибка, К сожалению, твой монитор не подходит под данную функцию, настрой Resolution.
	}
		return
;===================================================================================
			defolt:
	Filedelete, %A_ScriptDir%\Settings.ini
	Reload
		return
;===================================================================================
			relog:
		ButtonПерезапуститьскрипт:
	Reload
	return
;===================================================================================
			exit:
		ButtonЗакрытьскрипт:
		MsgBox, 4, Exit, Вы действительно хотите закрыть скрипт?
	IfMsgBox, Yes
		{
		  ExitApp
		}
	IfMsgBox, No
		{
		  return
		}  
	return
;===================================================================================
			persona:
	Gui, 3: -MaximizeBox
	Gui, 3: Show, w250 h110, Ваша Визитка
	Gui, 3: Color, 838d96
	Gui, 3: Font, c0x000000
	Gui, 3: Add, Edit, x5 y10 w145 h21 vvdis, %vdis%
	Gui, 3: Add, Edit, x5 y60 w145 h21 vqfrac, %qfrac%
	Gui, 3: Add, Edit, x5 y35 w145 h21 vwTel, %wTel%
	Gui, 3: Add, Text, x140 y8 w115 h23 +0x200 +0x1, Discord Name
	Gui, 3: Add, Text, x140 y57 w115 h23 +0x200 +0x1, Ваша фракция
	Gui, 3: Add, Text, x140 y33 w115 h23 +0x200 +0x1, Номер телефона
	Gui, 3: Add, Button, x5 y85 w118 h20 gSaveData1, 𝐀𝐜𝐜𝐞𝐩𝐭
	Gui, 3: Add, Button, x128 y85 w120 h20 gGuiClose1, 𝐃𝐞𝐜𝐥𝐢𝐧𝐞
		return
;===================================================================================
			Mir:
	Gui, 7: -MaximizeBox
	Gui, 7: Show, w510 h165, 𝐌𝐢𝐫𝐚𝐧𝐝𝐚
	Gui, 7: Color, 838d96
	Gui, 7: Font, c0x000000
	Gui, 7: Add, Edit, x5 y5 w500 h20 vmMir1, %mMir1%
	Gui, 7: Add, Edit, x5 y30 w500 h20 vmMir2, %mMir2%
	Gui, 7: Add, Edit, x5 y55 w500 h20 vmMir3, %mMir3%
	Gui, 7: Add, Edit, x5 y80 w500 h20 vmMir4, %mMir4%
	Gui, 7: Add, Edit, x5 y105 w500 h20 vmMir5, %mMir5%
	Gui, 7: Add, Button, x50 y130 w400 h30 gSaveData5, 𝐀𝐜𝐜𝐞𝐩𝐭
		return
;===================================================================================,
			Cust:
	Gui, 14: -MaximizeBox
	Gui, 14: Show, w200 h123, 𝐂𝐮𝐬𝐭
	Gui, 14: Color, 838d96
	Gui, 14: Font, c0x000000
	Gui, 14: Add, Button, x3 y100 w95 h20 gSaveData8, 𝐀𝐜𝐜𝐞𝐩𝐭
	Gui, 14: Add, Button, x102 y100 w95 h20 grelog, 𝐃𝐞𝐜𝐥𝐢𝐧𝐞
		return
;=================================================================================== 
			badge:
	Gui, 14: -MaximizeBox
	Gui, 14: Show, w360 h75, Ваш Жетон
	Gui, 14: Color, 838d96
	Gui, 14: Font, c0x000000
	Gui, 14: Add, Edit, x5 y5 w350 h35 vgbadge, %gbadge%
	Gui, 14: Add, Text, x5 y27 w260 h42 +0x200 +0x1, Пишем полную отыгровку, не ставя "/do".
	Gui, 14: Add, Button, x260 y43 w45 h28 gSaveData8, 𝐀𝐜𝐜𝐞𝐩𝐭
	Gui, 14: Add, Button, x310 y43 w45 h28 gGuiClose12, 𝐃𝐞𝐜𝐥𝐢𝐧𝐞
		return
;=================================================================================== 
------------------------------------------------------------------------------------------------------------
                                        -----GuiClose-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
			GuiClose1:
	Gui 3: Destroy
		return
;===================================================================================
			GuiClose2:
	Gui 4: Destroy
		return
;===================================================================================
			GuiClose3:
	Gui 5: Destroy
		return
;===================================================================================
			GuiClose4:
	Gui 6: Destroy
		return
;===================================================================================
			GuiClose6:
	Gui 8: Destroy
		return
;===================================================================================
			GuiClose8:
	Gui 10: Destroy
		return
;===================================================================================
			GuiClose11:
	Gui 13: Destroy
		return
;===================================================================================
			GuiClose12:
	Gui 14: Destroy
		return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                                -----HotKeys-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
			steal:
		SendMessage, 0x50,, 0x4190419,, A
	SendInput, {t}
		sleep 200
	SendInput,/f Займусь похищением.
		sleep 200
	SendInput, {enter}
		sleep, %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/dep to all: %qfrac% займётся переговорами с захватчиками, ожидайте дальшейших указаний...
		sleep 200
	SendInput, {enter}
		return
;===================================================================================
			rel:
	Buttonrel:
		Reload
		return
;===================================================================================
			CODE0:
	SendInput, {t}
		sleep 200
	SendInput,/mark CODE-0 to ALL
		sleep 200
	SendInput, {enter}
		return
;===================================================================================
			CODE1:
	SendInput, {t}
		sleep 200
	SendInput,/mark CODE-1 to ALL
		sleep 200
	SendInput, {enter}
		return
;===================================================================================
			CODE7:
	SendInput, {t}
		sleep 200
	SendInput,/mark CODE-7 to ALL
		sleep 200
	SendInput, {enter}
		return
;===================================================================================
			CODE6:
	SendInput, {t}
		sleep 200
	SendInput,/mark CODE-6 to ALL
		sleep 200
	SendInput, {enter}
		return
;===================================================================================
			Geo:
	SendInput, {t}
		sleep 200
	SendInput,/mark code 10-20 to %qfrac%
		sleep 200
	SendInput, {enter}
		return
;===================================================================================
			qBadge:
		SendMessage, 0x50,, 0x4190419,, A
	SendInput, {t}
		sleep 200
	SendInput,/do %gbadge%.
		sleep 200
	SendInput, {enter}
		return
;===================================================================================
			Badgeq:
		if (Radio1Gen==1)
	{
		SendMessage, 0x50,, 0x4190419,, A
	SendInput, {t}
		sleep 200
	SendInput,/me присмотрелся к человеку напротив
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Какой символ идентификации можно увидеть на @ и что за информация на нем содержится?{Left 39}
	}
		else if (Radio2Gen==1)
	{
		SendMessage, 0x50,, 0x4190419,, A
	SendInput, {t}
		sleep 200
	SendInput,/me присмотрелась к опозновательному знаку человека напротив
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Какой опознавательный знак на человеке и что на нём написано?
		sleep 200
	SendInput, {enter}
	}
		else 
	{
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
	}
		return
;===================================================================================
			Inventory:
	SendInput, {i}
		return
;===================================================================================
			Signl:
		SendMessage, 0x50,, 0x4190419,, A
	SendInput, {t}
		sleep 200
	SendInput,/dep to all: Сработала ли сигнализация в каком либо частном/муниципальном заведении?
		sleep 200
	SendInput, {enter}
		return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                                -----Рации-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
	:?:.фиб::/dep to FIB:{space}
;===================================================================================
	:?:.пд::/dep to LSPD:{space}
;===================================================================================
	:?:.сд::/dep to LSCSD:{space}
;===================================================================================
	:?:.санг::/dep to SANG:{space}
;===================================================================================
	:?:.гов::/dep to GOV:{space}
;===================================================================================
	:?:.емс::/dep to EMS:{space}
;===================================================================================
	:?:.вн::/dep to WN:{space}
;===================================================================================
	:?:.гос::/dep to all:{space}
;===================================================================================
	:?:.волна::/dep to all: Занята ли гос волна на , если нет то занимаю...{Left 24}
;===================================================================================
	:?:.вз::/wnews{space}
;===================================================================================
	:?:.вч::/adv{space}
;===================================================================================
	:?:.сигналка::/dep to all: Сработала ли сигнализация в каком либо частном/муниципальном заведении?
;===================================================================================
	:?:.норм::/dep to all: Требования похитителей адекватные. Ждите дальнейших указаний...{enter}
;===================================================================================
	:?:.пуш::/dep to all: Требования похитителей неадекватные. Готовьте силы к штурму захватчиков...{enter}
;===================================================================================
	:?:.юр::/dep to LSCSD: Разрешите нарушить юрисдикцию для проведения комфортного патрулирования...{enter}
;===================================================================================
	:?:.фз::/dep to all: На Fort Zancudo напали{!} Нужна поддержка всех государственных силовых структур, всем 10-38{!} Повторяю на нас напали, всем 10-38...{enter}
;===================================================================================
			:?:.коридор::
	SendInput, /mark 10-20
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/dep to all: С моих 10-20 выехали похитители, на них действует зеленый коридор в радиусе %bSteal1% метров...
		sleep 200
	SendInput, {enter}
		return
;===================================================================================
			:?:.патрули::
	SendInput, /mark 10-20
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/dep to all: С моих 10-20 выехали похитители, прошу предоставить отмену патрулей на %bSteal2% секунд...
		sleep 200
	SendInput, {enter}
		return
;===================================================================================
			:?:.пох::
	SendInput,/dep to all: %qfrac% займётся переговорами с захватчиками, ожидайте дальшейших указаний...{enter}
		return
;===================================================================================
			:?:.гетто::
	SendInput,/dep to SANG: Окажите поддержку в городе Los Santos, а также "Ghetto", обстановка с криминальными еденицами обострилась. Ориентир "code 10-20" от нашей структуры или же центр района...{enter}
		return
;===================================================================================
			:?:.адвокат::
	SendInput,/dep to GOV: В соответствии с законодательством нашей страны, гарантирующим права задержанных граждан на юридическую помощь, я обращаюсь к Вам, уважаемый адвокат, с просьбой обеспечить задержанного квалифицированной юридической защитой. Согласно Статье 16 Пункту 2.1 Процессуального кодекса, если задержанный изъявил желание воспользоваться услугами государственного адвоката, сотрудник, производящий задержание, обязан немедленно сообщить в департамент о необходимости явки государственного адвоката по месту нахождения задержанного. В данном случае, я как представитель правоохранительных органов, действую в соответствии с законом и уведомляю Вас о необходимости оказания юридической помощи задержанному. В целях обеспечения прав граждан и соблюдения принципа равенства перед законом, я прошу Вас обеспечить задержанного квалифицированной юридической защитой. По этой причине прошу прибыть в КПЗ LSPD по адресу Мишн-Роу для обеспечения юридической защиты задержанного. Ожидаю Вашего ответа в течение пяти минут. 
          return
;===================================================================================
			:?:.прокурор::
	SendInput, /dep to GOV: Запрашиваю прокурора в КПЗ LSPD Мишн-Роу.
	    return
;===================================================================================
			:?:.кпп1::
	SendInput, /dep to all: Внимание, у КПП-1 Forta Zancudo скопление автомобилей и множество граданских, возможно вооружены. Будьте на готове{!}{enter}
	return
;===================================================================================
			:?:.кпп2::
	SendInput, /dep to all: Внимание, у КПП-2 Forta Zancudo скопление автомобилей и множество граданских, возможно вооружены. Будьте на готове{!}{enter}
	return
;===================================================================================
			:?:.госнабор::
	SendInput, /dep to all: Занял гос. волну... 
		sleep 300
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/gnews Уважаемые жители штата! В данный момент проходит набор в ряды академии LSPD. Требования для трудоустройства: возраст от 21 года, иметь опрятный внешний вид, права категории Drive D, мед. карту, военный билет, и отсутствие судимостей. Набор проходит в холле LSPD. На карте штата мы отмечены синим щитом. Также, мы всегда рады выдать вам лицензии на оружие, для этого необходимо иметь при себе 15 000 $. С уважением, сотрудники отдела PAI!
		sleep 200
	SendInput, {enter}
	return
;===================================================================================
			:?:.гослиц::
	SendInput, /dep to all: Занял гос. волну... 
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/gnews [Уведомление] Внимание{!} %qfrac% информирует{!} Сейчас будет проходить выдача лицензий в центральном отделении %qfrac%. В течении следующего часа Вы можете посетить отделение %qfrac%. При себе иметь: медицинское освидетельствование, 25.000$ и знание законов штата{!} С уважением руководящий состав %qfrac%...
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/dep to all: Освободил гос. волну...
	return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                                -----Коды-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
	:?:.код7::/mark CODE-7 to ALL {enter}
;===================================================================================
	:?:.код0::/mark CODE-0 to ALL {enter}
;===================================================================================
	:?:.код1::/mark CODE-1 to ALL {enter}
;===================================================================================
	:?:.код4::/mark CODE-4 to ALL {enter}
;===================================================================================
			:?:.к12::
	SendInput, /mark code 10-20 to %qfrac% {enter}
	return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                                -----Коды v2-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
	:?:/r7::/mark CODE-7 to ALL {enter}
;===================================================================================
	:?:/r0::/mark CODE-0 to ALL {enter}
;===================================================================================
	:?:/r1::/mark CODE-1 to ALL {enter}
;===================================================================================
			:?:/r12::
	SendInput, /mark code 10-20 to %qfrac% {enter}
	return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                                -----Команды-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
	:?:.ьу::/me
;===================================================================================
	:?:.вщ::/do
;===================================================================================
	:?:.фссузе::/accept{space}{backspace}
;===================================================================================
	:?:.куз::/report{space}{backspace}
;===================================================================================
	:?:/rep::/report{space}{backspace}
;===================================================================================
	:?:.пут::/put{space}{backspace}
;===================================================================================
	:?:.пул::/pull{space}{backspace}
;===================================================================================
	:?:.кл::/clearchat{enter}
;===================================================================================
	:?:.мут::/vmute{space}{backspace}
;===================================================================================
	:?:.с::/c{space}{backspace}
;===================================================================================
	:?:.си::/cb{space}{backspace}
;===================================================================================
	:?:.ы::/s{space}{backspace}
;===================================================================================
	:?:.и::/b{space}{backspace}
;===================================================================================
	:?:.а::/f{space}{backspace}
;===================================================================================
	:?:.аи::/fb{space}{backspace}
;===================================================================================
	:?:.ц::/w{space}{backspace}
;===================================================================================
	:?:.су::/su{space}{backspace}
;===================================================================================
	:?:.ыг::/su{space}{backspace}
;===================================================================================
	:?:.ев::/event{enter}
;===================================================================================
	:?:.есп::/netstat{enter}
;===================================================================================
	:?:.зфн::/pay{space}{backspace}
;===================================================================================
	:?:.ка::Запись Кадрового Аудита
;===================================================================================
			:?:.высер::
	SendInput, /b Куприв, вы упали от пацанчиков из %qfrac%. Впитывай бро) Приятной игры{!}{enter}
	return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                                -----Повседневка-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
			:?:.опзо::
		if (Radio1Gen==1)
	{
	SendInput,/me присмотрелся к человеку напротив
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Какой символ идентификации можно увидеть на @ и что за информация на нем содержится?{Left 39}
		sleep 200
	SendInput, {enter}
	}
		else if (Radio2Gen==1)
	{
	SendInput,/me присмотрелась к опозновательному знаку человека напротив
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Какой опознавательный знак на человеке и что на нём написано?
		sleep 200
	SendInput, {enter}
	}
		else 
	{
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
	}
		return
;===================================================================================
			:?:.кам::
		if (Radio1Gen==1)
	{
	SendInput,/me достал маленькую камеру из кармана и аккуратно закрепил на воротнике, после чего нажал на кнопку записи
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Применяемый прибор, который находится в состоянии размещения, представляет собой устройство для захвата видеоинформации и автоматического непрерывного регистрационного процесса. Название применяемой камеры - Криптоаналитический Системный Аппарат для Длительной Фиксации (КСА-ДФ).
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do КСА-ДФ закреплен на воротнике. Он включен и ведет непрерывную запись.
		sleep 200
	SendInput, {enter}
	}
		else if (Radio2Gen==1)
	{
	SendInput,/me достала "Боди-камеру" из рюкзака и закрепила на груди, проверив её работоспособность
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Боди-камера ведёт непрерывную запись видео.
		sleep 200
	SendInput, {enter}
	}
		else 
	{
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
	}
		return
;===================================================================================
			:?:.взятка::
	SendInput,/do Есть ли у человека аудио/видеофиксация?
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/b /do Нет.
		sleep 200
	SendInput, {enter}
	return
;===================================================================================
			:?:.бейдж::
		if (Radio1Gen==1)
	{
	SendInput,/me указал пальцем на бейдж
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do На цепочке с плетением "Ромб Двойной", сделанной из красного золота 585 пробы, у которой примерный вес составляет 15 грамм, висит элемент униформы - бейдж, который содержит данные, позволяющие идентифицировать лицо, которое его носит. Бейдж лежит в прозрачной с гравировкой "LSPD" обложке, наверху которой напечатана надпись "High Rank". На бейдже напечатана четкая надпись, покрытая бесцветным изолирующим покрытием на базе алкидного полимера [ - ***].
		sleep 200
	SendInput, {enter}
	}
		else if (Radio2Gen==1)
	{
	SendInput, /me указала пальцем на бейдж{enter}
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do %gbadge%.{enter}
		sleep 200
	SendInput, {enter}
	}
		else 
	{ 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
	}
		return
;===================================================================================
			:?:.нарко::
		if (Radio1Gen==1)
	{
	SendInput,/do Кейс в руках.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me открыл кейс, после чего достал портативное устройство
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me нажал на кнопку "Идентификация неизвестного вещества"
		sleep 200
	SendInput, {enter}
	     sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me достал пакетик с неизвестным веществом, после чего насыпал в портативное устройство
		sleep 200
	SendInput, {enter}
	     sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Неизвестное вещество внутри устройства.
		sleep 200
	SendInput, {enter}
          sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me нажал на кнопку "Начать идентификацию"
		sleep 200
	SendInput, {enter}
	      sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Идет идентификация вещества.
		sleep 200
	SendInput, {enter}
          sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Портативное устройство показало результаты.
		sleep 200
	SendInput, {enter}
	     sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do На мониторе написано: основное химическое вещество - Каннабис.
		sleep 200
	SendInput, {enter}
	}
		else if (Radio2Gen==1)
	{
	SendInput,/me обнюхала человека
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Есть ли у человека наркотические вещества?
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Исходит ли от человека запах пороховых газов?
		sleep 200
	SendInput, {enter}
	}
		else 
	{ 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
	}
		return
;===================================================================================
			:?:.визитка::
		if (Radio1Gen==1)
	{
	SendInput,/me достал визитку и протянул человеку напротив
		sleep 200
	SendInput,{enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do На визитке, отчётливая надпись "E-mail": %vdis%.
		sleep 200
	SendInput,{enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Чуть ниже, отчётливая надпись "Номер телефона": %wTel%.
		sleep 200
	SendInput,{enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В верхней левой части, надпись "Организация": %qfrac%.
		sleep 200
	SendInput,{enter}
	}
		else if (Radio2Gen==1)
	{
	SendInput,/me достала визитки и протянула человеку
		sleep 200
	SendInput,{enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do На визитке, отчётливая надпись "E-mail": %vdis%.
		sleep 200
	SendInput,{enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Чуть ниже, отчётливая надпись "Номер телефона": %wTel%.
		sleep 200
	SendInput,{enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,{enter}
	}
		else 
	{ 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
	}
		return
;===================================================================================
			:?:.дис::
	SendInput, /b Напиши мне в DISCORD: %vdis%.{enter}
	return
;===================================================================================
			:?:.лдв::
		if (Radio1Gen==1)
	{
	SendInput, /me достал ключ-карту и провёл по панели
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Дверь закрыта.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me убрал ключ-карту в карман
		sleep 200
	SendInput, {enter}
	}
		else if (Radio2Gen==1)
	{
	SendInput,/me достала ключ-карту и провела по панели
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Дверь закрыта.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me убрала ключ-карту в кармана
		sleep 200
	SendInput, {enter}
	}
		else 
	{ 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
	}
		return
;===================================================================================
			:?:.одв::
		if (Radio1Gen==1)
	{
	SendInput,/me достал ключ-карту и провёл по панели
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Дверь открыта.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me убрал ключ-карту в карман
		sleep 200
	SendInput, {enter}
	}
		else if (Radio2Gen==1)
	{
	SendInput, /me достала ключ-карту и провела по панели {enter}
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput, {t}/do Дверь открыта.{enter}
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput, {t}/me убрала ключ-карту в карман {enter}
		sleep 200
	SendInput, {enter}
	}
		else 
	{ 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
	}
		return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                        		-----RolePlay-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
			:?:.анаболик::
		if (Radio1Gen==1)
	{
	SendInput,/me нырнув руками в подсумок, вытянул оттуда белые стерильные перчатки и натянул их на руки
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Перчатки одеты.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me достал из подсумка коробочку содержащую дозированный седативный препарат
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Коробочка оранжевого цвета с надписью: "Paramedic".
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Чуть ниже надпись мелким шрифтом: "Benzodiazepines".
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me открыл коробочку и достал шприц-инектор
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Рядом стоит спирт и лежит кусочек ваты.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me открыл спирт и смочил ватку
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me протёр место инъекции и сделал укол
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me достал зелёную коробочку и положил туда использованный шприц
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me закрыл обе коробочки и убрал их в подсумок
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput,/me нырнув руками в подсумок, вытянула оттуда белые стерильные перчатки и натянула их на руки
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Перчатки одеты.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me достала из подсумка коробочку содержащую дозированный седативный препарат
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Коробочка оранжевого цвета с надписью: "Paramedic".
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Чуть ниже надпись мелким шрифтом: "Benzodiazepines".
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me открыла коробочку и достала шприц-инектор
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Рядом стоит спирт и лежит кусочек ваты.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me открыла спирт и смочила ватку
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me протёрла место инъекции и сделала укол
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me достала зелёную коробочку и положила туда использованный шприц
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me закрыла обе коробочки и убрала их в подсумок
		sleep 200
	SendInput, {enter}
    }
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.фрапс::
		if (Radio1Gen==1)
    {
	SendInput, /me вытащил флешку с файлами из боди-камеры
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me достал персональный компьютер, после чего включил его
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Экран компьютера включен.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me вставил флешку в компьютер
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me открыл папку с видео и сохранил последний видеофайл
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Видеофайл сохранился.
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me открыл почту, после чего нужный адрес
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me отправил последний сохраненный видеофайл
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Видеофайл отправлен на почту.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me убрал флешку в карман
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me выключил компьютер, после чего убрал его{enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me нажала на клавиатуре "space"
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Экран комьютера включился.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do На столе лежит папка с делом.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me открыла папку и осмотрела дело
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me открыла базу граждан "Data Base", зашла в раздел "Федеральный розыск"
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Перед лицом агента высветилась анкета с графами: "Имя и Фамилия разыскиваемого", "Паспорт разыскиваемого", "Контактная информация", "Уровень розыска", "Награда за поимку" и "Материалы дела"
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me заполнила необходимые граффы указаные в анкете
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me перепроверила заполненные данные
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/do Данные соответствуют заявленным.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me нажала на кнопку "Объявить в розыск"
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me ввёл номер телефона "" и нажала кнопку "Отслеживать"{left 31}
    }
        else 
    {
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.тикет::
		if (Radio1Gen==1)
    {
	SendInput,/me достал блокнот с тикетами, открыл пустой "тикет" и начал заполнять
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me вписал статьи нарушения и гос номер авто
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me вызвал эвакуатор по номеру "тикета"
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput,/me достала блокнот с тикетами, открыла пустой "тикет" и начала заполнять
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput, {t}
		sleep 200
	SendInput,/me вписала статьи нарушения и гос номер авто
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me вызвала эвакуатор по номеру "тикет`а"
		sleep 200
	SendInput, {enter}
    }
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.обыск::
		if (Radio1Gen==1)
    {
	SendInput, /me осуществил маневр опускания своих верхних конечностей в соседние отверстия в текстильной одежде, захватив с собой находящиеся в них предметы, а именно - белые перчатки. Подобрав их к себе, произвел надевание указанных перчаток на свои кисти
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Перчатки надеты.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me провёл руками по верхней части тела
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me проверил карманы
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me провёл руками по ногам
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me нырнула руками в карманы, вытянула оттуда белые перчатки и натянула их на руки
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Перчатки одеты.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me провела руками по верхней части тела
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me проверила карманы
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me провела руками по ногам
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Где у человека документы, мед справки и лицензии?
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput, {t}/do Есть ли аудио/видео фиксация?
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.грим::
		if (Radio1Gen==1)
    {
	SendInput, /me нырнул руками в подсумок, вытянул оттуда влажные салфетки и открыл пачку
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достал салфетку и предерживая лицо человека начал вытирать грим
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me протер основные элементы лица
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me осмотрел лицо человека
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Лицо подходит для определиния по DataBase.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me выкинул салфетку в урну, закрыл пачку и убрал обратно в подсумок
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me нырнула руками в подсумок, вытянул оттуда влажные салфетки и открыла пачку
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достала салфетку и предерживая лицо человека начала вытирать грим
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me протерла основные элементы лица
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me осмотрела лицо человека
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Лицо подходит для определиния по DataBase.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me выкинула салфетку в урну, закрыла пачку и убрала обратно в подсумок
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.полиграф::
		if (Radio1Gen==1)
    {
	SendInput, /do Полиграф стоит на столе.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do На тумбе стоит компьютер.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Полиграф подключен к компьютеру.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me включил компьютер
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Компьютер работает.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me включил полиграф
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Полиграф включен.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do От полиграфа идут две группы датчиков на присосках.
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /do Полиграф стоит на столе.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do На тумбе стоит компьютер.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Полиграф подключен к компьютеру.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me включила компьютер
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Компьютер работает.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me включила полиграф
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Полиграф включен.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do От полиграфа идут две группы датчиков на присосках.
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.провода::
		if (Radio1Gen==1)
    {
	SendInput,/me взял первую группу датчиков на присосках и подключил к руке человека напротив
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Первая группа датчиков подключена.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взял вторую группу датчиков на присосках и подключил к голове человека напротив
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Вторая группа датчиков подключена.
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput,/me взяла первую группу датчиков на присосках и подключила к руке человека напротив
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Первая группа датчиков подключена.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взяла вторую группу датчиков на присосках и подключила к голове человека напротив
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Вторая группа датчиков подключена.
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.скам1::
		if (Radio1Gen==1)
    {
	SendInput, /do Бардачок закрыт.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me открыл бардачок
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me нырнув руками в карманы, вытянул оттуда лицензии, ID карту, мед.справки и сложил в бардачок
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Документы лежат в бардачке автомобиля.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me закрыл бардачок
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Бардачок закрыт.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достал маленькую камеру из кармана и аккуратно закрепил на воротнике, после чего нажал на кнопку записи видео
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Применяемый прибор, который находится в состоянии размещения, представляет собой устройство для захвата видеоинформации и автоматического непрерывного регистрационного процесса. Название применяемой камеры - Криптоаналитический Системный Аппарат для Длительной Фиксации (КСА-ДФ). 
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В подлокотнике лежит балончик с искусственной грязью.
		sleep 350
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 350
	SendInput,/me достал балончик и попшикал его внутренним веществом на пальцы рук
		sleep 350
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Пальцы рук сильно запачканы грязью.
		sleep 200
	SendInput, {enter}
	}
        return
		
		:?:.скам2::
		if (Radio1Gen==1)
    {
	SendInput, /do ID карты, лицензий, мед.справок при себе нет.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Пальцы рук сильно запачканы грязью.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do КСА-ДФ закреплен на воротнике. Он включен и ведет непрерывную запись.
		sleep 200
	SendInput, {enter}
	}
		return
;===================================================================================
			:?:.дрон::
		if (Radio1Gen==1)
    {
	SendInput, /me достал кейс с дроном и открыл его
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me положил крышку на землю и поставил на неё дрон
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me протёр линзу дрона, заранее подготовленной влажной салфеткой
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Дрон в исправном состоянии и функционирует.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Камера дрона имеет захвать 230 градусов и оснащена камерой "2K HD FPV".
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Запись идёт на съёмный носитель в камере.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достал пульт управления и включил дрон
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Дрон успешно взлетел и готов к работе.
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me достала кейс с дроном и открыла его
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me положила крышку на землю и поставила на неё дрон
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me протёрла линзу дрона, заранее подготовленной влажной салфеткой
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Дрон в исправном состоянии и функционирует.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Камера дрона имеет захвать 230 градусов и оснащена камерой "2K HD FPV".
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Запись идёт на съёмный носитель в камере.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достала пульт управления и включила дрон
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Дрон успешно взлетел и готов к работе.
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.угон::
		if (Radio1Gen==1)
    {
	SendInput, /me извлек из одного из карманов портативное электронное устройство типа планшета и, проявляя осторожность и внимательность, поместил свою руку поверх дисплея в целях предотвращения доступа к информации третьими лицами
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Планшет заблокирован.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me ввёл пароль
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Планшет разблокирован.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В планшете база данных штата San Andreas.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me вошёл в базу данных на автомобили штата San Andreas
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Открыта база данных на автомобили.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me произвел ввод регистрационного номера автомобиля в систему с целью осуществления проверки наличия информации об угоне данного транспортного средства
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Согласно выданным базой данных сведениям, предоставленным в электронной форме, указанное транспортное средство имеет статус угнанного.
			}
        else if (Radio2Gen==1)
    {
	SendInput, /me достала планшет из под бронежилета
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Планшет заблокирован.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me ввела пароль
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Планшет разблокирован.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В планшете база данных штата San Andreas.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me вошла в базу данных на автомобили штата San Andreas
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Открыта база данных на автомобили.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me ввела номер авто и проверила числиться ли оно в угоне
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do База выдала, что данное Т/С числиться как угнанное.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достала тикет и телефон, приклеила тикет на ТС
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me вызвала эвакуатор по номеру тикета
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.кпк::
		if (Radio1Gen==1)
    {
	SendInput, /me достал карманный персональный компьютер
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Карманный персональный компьютер активен.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me открыл базу данных
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Открыта база данных, на граждан San Andreas.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me открыл раздел %qfrac%, после чего открыл DataBase
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me заполнил графу: возвраст, прописка, Имя_Фамилия. Также прикрепил фото задержанного.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Сведения, относящиеся к личности задержанного, проанализированы и занесены в установленный порядок в персональную анкету данного лица.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me произвел нажатие на соответствующую кнопку в системе, активизирующую процедуру объявления лица в розыск
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/su{space}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me достала карманный персональный компьютер, держа в руке документы человека
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Карманный персональный компьютер активен.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me открыла базу данных
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Открыта база данных, на граждан San Andreas.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me открыла раздел %qfrac%, после чего открыла DataBase
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me заполнила графу: национальность, возвраст, прописка, Имя_Фамилия
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Персональная анкета задержанного заполнена.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me нажала на кнопку "Объявить в розыск"
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/su{space}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.док::
		if (Radio1Gen==1)
    {
	SendInput, /me нажал кнопку включения на системном блоке компьюетра{enter}
		sleep %sTime%
	SendInput, {t}/do Компьютер включен.{enter}
		sleep %sTime%
	SendInput, {t}/me открыл на компьютере текстовый редактор {enter}
		sleep %sTime%
	SendInput, {t}/do Текстовый редактор открыт на компьютере и готов к работе.{enter}
		sleep %sTime%
	SendInput, {t}/me напечатал в текстовом редакторе название докумета{enter}
		sleep %sTime%
	SendInput, {t}/do Документ называется
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me нажала кнопку включения на системном блоке компьюетра{enter}
		sleep %sTime%
	SendInput, {t}/do Компьютер включен.{enter}
		sleep %sTime%
	SendInput, {t}/me открыла на компьютере текстовый редактор {enter}
		sleep %sTime%
	SendInput, {t}/do Текстовый редактор открыт на компьютере и готов к работе.{enter}
		sleep %sTime%
	SendInput, {t}/me напечатала в текстовом редакторе название докумета{enter}
		sleep %sTime%
	SendInput, {t}/do Документ называется{enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.пдок::
		if (Radio1Gen==1)
    {
	SendInput, /me продолжил печатать документ в текстовом редакторе{enter}
		sleep %sTime%
	SendInput, {t}/do Документ напечатан.{enter}
		sleep %sTime%
	SendInput, {t}/do Принтер включен.{enter}
		sleep %sTime%
	SendInput, {t}/me нажал в текстовом редакторе "сохранить", после чего "печать"{enter}
		sleep %sTime%
	SendInput, {t}/do Принтер в процессе печали документа.{enter}
		sleep %sTime%
	SendInput, {t}/do Документ распечатан.{enter}
		sleep %sTime%
	SendInput, {t}/me достал документ из принтера и положил в папку{enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me продолжила печатать документ в текстовом редакторе{enter}
		sleep %sTime%
	SendInput, {t}/do Документ напечатан.{enter}
		sleep %sTime%
	SendInput, {t}/do Принтер включен.{enter}
		sleep %sTime%
	SendInput, {t}/me нажала в текстовом редакторе "сохранить", после чего "печать"{enter}
		sleep %sTime%
	SendInput, {t}/do Принтер в процессе печали документа.{enter}
		sleep %sTime%
	SendInput, {t}/do Документ распечатан.{enter}
		sleep %sTime%
	SendInput, {t}/me достала документ из принтера и положила в папку{enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.кпз::
		if (Radio1Gen==1)
    {
	SendInput, /me достал ключ-карту и провёл по панеле
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Дверь открыта.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me убрал ключ-карту в карман
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me завёл человека в камеру
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me снял с человека наручники после чего закрыл решётку
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достал ключ-карту и провёл по панеле
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Дверь закрыта.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me убрал ключ-карту в карман
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me достала ключ-карту и провела по панеле
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Дверь открыта.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me убрала ключ-карту в карман
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me завела человека в камеру
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me сняла с человека наручники после чего закрыла решётку
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достала ключ-карту и провела по панеле
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Дверь закрыта.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me убрала ключ-карту в карман
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.информатор::
		if (Radio1Gen==1)
    {
	SendInput,/do На столе лежат: Экшн-камера, Мини-Диктофон, Жучек.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взял в руки аппаратуру и начал поочередно закреплять на одежде человека напротив
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Экшн-камера висит на груди у человека.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Мини-Диктофон спрятан в штанах человека напротив.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Жучек закреплен на внутренней части обуви.
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput,/do На столе лежат: Экшн-камера, Мини-Диктофон, Жучек.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взяла в руки аппаратуру и начала поочередно закреплять на одежде человека напротив
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Экшн-камера висит на груди у человека.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Мини-Диктофон спрятан в штанах человека напротив.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Жучек закреплен на внутренней части обуви.
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.реклама::
		if (Radio1Gen==1)
    {
	SendInput, /me нырнул руками в карманы
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достал контракт и протянул человеку
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В контракте описаны условия рекламы, согласно прайс листу.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В контракте также содержится напоминание о не возможности "pay-back".
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me нырнула руками в карманы
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достала контракт и протянула человеку
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В контракте описаны условия рекламы, согласно прайс листу.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В контракте также содержится напоминание о не возможности "pay-back".
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.отпечатки::
		if (Radio1Gen==1)
    {
	SendInput,/do На столе стоит компьютер.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
	    sleep 200
	SendInput,/me включил компьютер
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Компьютер включен.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me вошёл в базу данных
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Открыта база данных, на граждан штата San Andreas.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Сканер отпечатков пальцев подключён к компьютеру.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взял задержанного за руку и приложил нужные пальцы к сканеру
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do На экран компьютера вывелась информация о человеке: Имя Фамилия - @ Номер id карты - .{Left 19}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me включила компьютер
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Компьютер включен.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me вошла в базу данных
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Открыта база данных, на граждан штата San Andreas.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Сканер отпечатков пальцев подключён к компьютеру.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взяла задержанного за руку и приложила нужные пальцы к сканеру
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do На экран компьютера вывелась информация о человеке.
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.конт::
		if (Radio1Gen==1)
    {
	SendInput, /me нырнул руками в карманы
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достал контракт и положил на стол
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В контракте описаны условия: В случае увольнения Вы обязаны оплатить неустойку - 10.000$, а также отработать следующие 24 часа.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В случае каких либо вкладов в Казну организации - "pay-back" не возможен.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достал ручку и положил подле контракта
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me нырнула руками в карманы
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достала контракт и положила на стол
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В контракте описаны условия: В случае увольнения Вы обязаны оплатить неустойку - 10.000$, а также отработать следующие 24 часа.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В случае каких либо вкладов в Казну организации - "pay-back" не возможен.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достала ручку и положила подле контракта
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.бдкпк::
		if (Radio1Gen==1)
    {
	SendInput, /me достал мобильный телефон и зафиксировал изображение задержанного, а затем сохранил его в облачном хранилище
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Фото сохранено.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me включил планшет
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Планшет заблокирован.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me ввёл пароль
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Планшет разблокирован.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В планшете база данных, на граждан штата San Andreas.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me начал поиск по фото в базе данных
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do С помощью технологий отображения данных на планшете была представлена информация о конкретном человеке. Для достижения этого результата были задействованы различные компоненты, включающие в себя аппаратные и программные элементы. Перед тем, как данные были выведены на экран планшета, они были обработаны и подготовлены для вывода с использованием процессоров, оперативной памяти и графических ускорителей. После этого информация была передана на экран планшета, который осуществил ее отображение с помощью своих технологий дисплея. Процесс вывода информации на экран планшета был выполнен в режиме реального времени, с учетом всех необходимых технических параметров и характеристик системы.
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me достала телефон и сделала фото задержанного после чего сохранила в облако
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Фото сохранено.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me включила планшет
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Планшет заблокирован.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me ввела пароль
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Планшет разблокирован.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В планшете база данных, на граждан штата San Andreas.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me начала поиск по фото в базе данных
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do На экран планшета вывелась информация о человеке.
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.порт::
		if (Radio1Gen==1)
    {
	SendInput, /me приспустил лямки рюкзака и расстегнул его, поставив на пол
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me осмотрел рюкзак
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Что содержит в себе рюкзак?
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me приспустила лямки рюкзака и расстегнула его, поставив на пол
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me осмотрела рюкзак
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Что содержит в себе рюкзак?
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.делкам::
		if (Radio1Gen==1)
    {
	SendInput, /do Данные храниться в архиве.{enter}
		sleep %sTime%
	SendInput, {t}/me зашел в архив {enter}
		sleep %sTime%
	SendInput, {t}/me удалил данные с 00:00 по 00:00 {enter}
		sleep %sTime%
	SendInput, {t}/do Данные удалены.{enter}
		sleep %sTime%
	SendInput, {t}/me вышел из архива {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /do Данные храниться в архиве.{enter}
		sleep %sTime%
	SendInput, {t}/me зашла в архив {enter}
		sleep %sTime%
	SendInput, {t}/me удалила данные с 00:00 по 00:00 {enter}
		sleep %sTime%
	SendInput, {t}/do Данные удалены.{enter}
		sleep %sTime%
	SendInput, {t}/me вышла из архива {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.сумка::
		if (Radio1Gen==1)
    {
	SendInput, /me взял сумку с деньгами
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me закрыл сумку с деньгами
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me повесил сумку на плечо
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В кармане geo-маячёк.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me подкинул маячёк в сумку
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Geo-маячёк активен.
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me взяла сумку с деньгами
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me закрыла сумку с деньгами
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me повесила сумку на плечо
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В кармане geo-маячёк.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me подкинула маячёк в сумку
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Geo-маячёк активен.
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.рп::
		if (Radio1Gen==1)
    {
	SendInput, /me достал резиновые пули из подсумка {enter}
		sleep %sTime%
	SendInput, {t}/do Коробочка с пулями в руках.{enter}
		sleep %sTime%
	SendInput, {t}/me зарядил резиновые пули в обойму {enter}
		sleep %sTime%
	SendInput, {t}/do Оружие заряжено резиновыми пулями.{enter}
		sleep %sTime%
	SendInput, {t}/me убрал коробочку обратно в подсумок {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me достала резиновые пули из подсумка {enter}
		sleep %sTime%
	SendInput, {t}/do Коробочка с пулями в руках.{enter}
		sleep %sTime%
	SendInput, {t}/me зарядила резиновые пули в обойму {enter}
		sleep %sTime%
	SendInput, {t}/do Оружие заряжено резиновыми пулями.{enter}
		sleep %sTime%
	SendInput, {t}/me убрала коробочку обратно в подсумок {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.пмп::
		if (Radio1Gen==1)
    {
	SendInput, /do В подсумке лежит медицинский пакет нового поколения и дефибриллятор.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достал из подсумка дефибриллятор и эпинефрин
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me дал разряд из дефибриллятора и вколол эпинефрин
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Человек начал приходить в сознание.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me аккуратно убрал дефибриллятор в подсумок
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me помог встать человеку и осмотрел его лицо
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /do В подсумке лежит медицинский пакет нового поколения и дефибриллятор.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достала из подсумка дефибриллятор и эпинефрин
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me сделала разряд из дефибриллятора и вколола эпинефрин
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Человек начал приходить в сознание.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me аккуратно убрала дефибриллятор в подсумок
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me помогла встать человеку и осмотрела его лицо
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.вин::
		if (Radio1Gen==1)
    {
	SendInput, /me нырнул руками в карманы, вытянул оттуда перчатки и натянул их на руки
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Перчатки надеты.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me открыл водительскую дверь, после чего осмотрел стойку водительской двери
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достал планшет, прикрыв его рукой от посторонних глаз, после чего зашел в базу данных, проверил VIN номер и сравнил с ориентировкой
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Данные в реестре и на VIN номере авто совпали.
	}
        else if (Radio2Gen==1)
    {
	SendInput, /me нырнула руками в карманы, вытянула оттуда перчатки и натянула их на руки
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Перчатки одеты.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me открыла водительскую дверь, после чего осмотрела стойку водительской двери
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me проверила VIN номер и сравнила с ориентировкой
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Данные в реестре и на VIN номере авто совпали.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достала тикет и телефон, приклеила тикет на ТС
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me вызвала эвакуатор по номеру тикета
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.лиц::
		if (Radio1Gen==1)
    {
	SendInput,  Здравствуйте, я сотрудник LSPD. Заранее скажу, что стоимость лицензии составляет 15.000. От вас требуются мед.справки, а также документы.
		sleep 200
	SendInput, {enter}
			}
        else if (Radio2Gen==1)
    {
	SendInput, /do На плече висит сумка.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me сняла сумку с плеча, после чего расстегнула её и поставила на землю 
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В сумке находится .000$.{Left 6}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.радио::
		if (Radio1Gen==1)
    {
	SendInput, /do В кармане лежит высокопроизводительный флеш-накопитель USB типа А с чрезвычайно высокой скоростью передачи данных, объем которого составляет 1 TБ.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достал флеш-накопитель и вставил в автомагнитолу "Teyes CC3 2k", которая оснащена 8 ядерным процессором, звуковым чипом DPS Adau1701, оптоволоконным и коаксиальным цифровым аудиовыходом и USB-разъёмом с током зарядки до 1.2А 
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me нажал на "play"
		sleep 200
	SendInput, {enter}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /do В кармане лежит флешка.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me достала флешку и вставила в магнитолу
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me нажала на "play"
		sleep 200
	SendInput, {enter}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
			:?:.кровь::
		if (Radio1Gen==1)
    {
	SendInput, /do В шкафчике стоит медицинский набор.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В него входит: Жгут, шприц для забора крови, вата, бинт, реактивы, пробирки и тп.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me открыл набор и разложил перед собой
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взял жгут и перетянул руку человеку, выше локтя
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взял человека за лодонь и собрал руку в кулак
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me сжал руку человека несколько раз
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Вена оптимальна для забора крови.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взял ватку, смочив её спиртом и протёр место забора
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me кинул ватку в ящик, после чего взял шриц, сняв с него колпачок
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me аккуратным движением ввёл иглу в вену, и набрал порядка пяти кубов крови
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me приложил ватку к месту укола и согнул руку челевека в локте
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,Держите так в течение минуты.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me отлил часть био-материала в пробирки и поставил их в кейс
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/b Для продолжения нажмите "LAlt".
		sleep 200
	SendInput, {enter}
		sleep 100
	Input, Delay, V, {LAlt}
		sleep 100
	SendInput,{t}
		sleep 200
	SendInput,/do На столе стоит прибор необходимый для определения принадлежности крови к носителю. Также прибор подключён к компьютеру с доступом к базе данных граждан штата San Andreas.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me добавил каплю крови на сенсор, после чего накрыл одноразовым стеклом и нажал на кнопку "Анализ"
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do На экране появилась шкала процесса, её показатель составляет 20 процентов.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Надпись чуть ниже: Примерное время ожидания 10 секунд.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/b Как только будешь готов нажми "LAlt".
		sleep 200
	SendInput, {enter}
		sleep 100
	Input, Delay, V, {LAlt}
		sleep 100
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Звуковой сигнал с оповещением о завершении процесса.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Тест показал что данный био-материал принадлежит гражданину с номером ID карты: .{Left 1}
	}
        else if (Radio2Gen==1)
    {
	SendInput, /do В шкафчике стоит медицинский набор.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do В него входит: Жгут, шприц для забора крови, вата, бинт, реактивы, пробирки и тп.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me открыла набор и разложила перед собой
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взяла жгут и перетянула руку человеку, выше локтя
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взяла человека за лодонь и собрала руку в кулак
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me сжала руку человека несколько раз
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Вена оптимальна для забора крови.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me взяла ватку, смочив её спиртом и протёрла место забора
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me кинула ватку в ящик, после чего взяла шриц, сняв с него колпачок
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me аккуратным движением ввела иглу в вену, и набрала порядка пяти кубов крови
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me приложила ватку к месту укола и согнула руку челевека в локте
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,Держите так в течении 10-15 минут.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me отлила часть био-материала в пробирки и поставила их в кейс
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/b Дальше проводить отыгровку нужно в лаборатории. Для продолжения нажмите "LAlt".
		sleep 200
	SendInput, {enter}
		sleep 100
	Input, Delay, V, {LAlt}
		sleep 100
	SendInput,{t}
		sleep 200
	SendInput,/do На столе стоит прибор необходимый для определения принадлежности крови к носителю. Также прибор подключён к компьютеру с доступом к базе данных граждан штата San Andreas.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me добавила каплю крови на сенсор, после чего накрыла одноразовым стеклом и нажала на кнопку "Анализ"
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do На экране появилась шкала процесса, её показатель составляет 20 процентов.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Надпись чуть ниже: Примерное время ожидания 20 секунд.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/b Как только будешь готов нажми "LAlt".
		sleep 200
	SendInput, {enter}
		sleep 100
	Input, Delay, V, {LAlt}
		sleep 100
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Звуковой сигнал с оповещением о завершении процесса.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Тест показал что данный био-материал на 99 процентов принадлежит гражданину с номером ID карты: .{Left 1}
	}
        else 
    { 
    MsgBox, 16, Ошибка, К сожалению, ты не оределился с полом, выставь нужный параметр.
    }
        return
;===================================================================================
            :?:.снятиедеп::
    Input, WalId, V, {LAlt} {Enter}
	SendInput,{t}
		sleep 200
	SendInput,/me достал флешку с кармана и вставил в USB порт
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me открыл записи рации департамента за %WalId% и скопировал на флешку данные о том кто был в эфире, а также сами записи переговоров
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/do Данные загружены, на съёмный USB носитель.
		sleep 200
	SendInput, {enter}
		sleep %sTime%
	SendInput,{t}
		sleep 200
	SendInput,/me вытянул флешку и положил в карман
		sleep 200
	SendInput, {enter}
        return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                                -----Прочее-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
	^F9::reload
;===================================================================================
	^F10::exitapp
;===================================================================================
			:?:.спавн::
		if (Radio1Gen==1)
    {
	SendInput, /fb Через 15 СЕКУНД произойдет перезагрузка автопарка %qfrac%. Для предотвращения утери автомобиля, рекомендуется всем занять места в нем и ожидать.
		sleep 200
	SendInput, {enter}
		sleep 5000
	SendInput,{t}
		sleep 200
	SendInput, /fb /spawncars через 10 секунд
		sleep 200
	SendInput, {enter}
		sleep 5000
	SendInput,{t}
		sleep 200
	SendInput,/fb /spawncars через 5 секунд
		sleep 200
	SendInput, {enter}
	      sleep 2000
	SendInput,{t}
		sleep 200
	SendInput,/fb /spawncars через 3 секунды
		sleep 200
	SendInput, {enter}
	    sleep 1000
	SendInput,{t}
		sleep 200
	SendInput,/fb /spawncars через 2 секунды
		sleep 200
	SendInput, {enter}
	     sleep 1000
	SendInput,{t}
		sleep 200
	SendInput,/fb /spawncars через 1 секунду
		sleep 200
	SendInput, {enter}
	    sleep 1000
	SendInput,{t}
		sleep 200
	SendInput,/spawncars 
    }
Return
	
;===================================================================================

------------------------------------------------------------------------------------------------------------
                                                -----Оверлеи-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
			Memo:
		if (Radio1Rez==1)
	{
    State2:=!State2
    If state2
    {
    CustomColor2 = 	EEAA99
    Gui 3: +LastFound +AlwaysOnTop -Caption +ToolWindow
    Gui 3: Color, black
    Gui 3: Font, s9
    Gui 3: Font, w3000
    Gui 3: Font, cFFFFFF
		Gui, 3: Add, Picture, x0 y0 w1920 h1080, %A_ScriptDir%\img\memo.png			
    WinSet, TransColor, %CustomColor2% 200
    Gui 3: Show, x%cX% y%cY% NoActivate, window.
    }  
    else
    Gui 3: Destroy
	}
		else if (Radio2Rez==1)
	{
    State2:=!State2
    If state2
    {
    CustomColor2 = 	EEAA99
    Gui 3: +LastFound +AlwaysOnTop -Caption +ToolWindow
    Gui 3: Color, black
    Gui 3: Font, s9
    Gui 3: Font, w3000
    Gui 3: Font, cFFFFFF
		Gui, 3: Add, Picture, x0 y0 w1680 h1050, %A_ScriptDir%\img\memo.png			
    WinSet, TransColor, %CustomColor2% 200
    Gui 3: Show, x%cX% y%cY% NoActivate, window.
    }  
    else
    Gui 3: Destroy
	}
		else if (Radio3Rez==1)
	{
    State2:=!State2
    If state2
    {
    CustomColor2 = 	EEAA99
    Gui 3: +LastFound +AlwaysOnTop -Caption +ToolWindow
    Gui 3: Color, black
    Gui 3: Font, s9
    Gui 3: Font, w3000
    Gui 3: Font, cFFFFFF
		Gui, 3: Add, Picture, x0 y0 w1440 h900, %A_ScriptDir%\img\memo.png			
    WinSet, TransColor, %CustomColor2% 200
    Gui 3: Show, x%cX% y%cY% NoActivate, window.
    }  
    else
    Gui 3: Destroy
	}
		else if (Radio4Rez==1)
	{ 
    State2:=!State2
    If state2
    {
    CustomColor2 = 	EEAA99
    Gui 3: +LastFound +AlwaysOnTop -Caption +ToolWindow
    Gui 3: Color, black
    Gui 3: Font, s9
    Gui 3: Font, w3000
    Gui 3: Font, cFFFFFF
		Gui, 3: Add, Picture, x0 y0 w1280 h1080, %A_ScriptDir%\img\memo.png			
    WinSet, TransColor, %CustomColor2% 200
    Gui 3: Show, x%cX% y%cY% NoActivate, window.
    }  
    else
    Gui 3: Destroy
	}
		else if (Radio5Rez==1)
	{ 
    State2:=!State2
    If state2
    {
    CustomColor2 = 	EEAA99
    Gui 3: +LastFound +AlwaysOnTop -Caption +ToolWindow
    Gui 3: Color, black
    Gui 3: Font, s9
    Gui 3: Font, w3000
    Gui 3: Font, cFFFFFF
		Gui, 3: Add, Picture, x0 y0 w1280 h720, %A_ScriptDir%\img\memo.png			
    WinSet, TransColor, %CustomColor2% 200
    Gui 3: Show, x%cX% y%cY% NoActivate, window.
    }  
    else
    Gui 3: Destroy
	}
		else if (Radio6Rez==1)
	{ 
    State2:=!State2
    If state2
    {
    CustomColor2 = 	EEAA99
    Gui 3: +LastFound +AlwaysOnTop -Caption +ToolWindow
    Gui 3: Color, black
    Gui 3: Font, s9
    Gui 3: Font, w3000
    Gui 3: Font, cFFFFFF
		Gui, 3: Add, Picture, x0 y0 w1920 h1920, %A_ScriptDir%\img\memo.png			
    WinSet, TransColor, %CustomColor2% 200
    Gui 3: Show, x%cX% y%cY% NoActivate, window.
    }  
    else
    Gui 3: Destroy
	}
		else 
	{ 
    MsgBox, 16, Ошибка, К сожалению, твой монитор не подходит под данную функцию, настрой Resolution.
	}
        return
;===================================================================================
			Mira:
	State3:=!State3
	If state3
	{
	CustomColor3 = EEAA99
	Gui +LastFound +AlwaysOnTop -Caption +ToolWindow 
	Gui, Color, black
	Gui, Font, s8
	Gui, Font, cYellow
	Gui, Font, w650
	Gui, Font,, verdana
	GUI, ADD,TEXT,cBlue,==============================================================================================
			GUI, ADD,TEXT,cRed,`                        		 Правило введёное Верховным судом USA:
			GUI, ADD,TEXT,c%rColor2%, %mMir1%
			GUI, ADD,TEXT,c%rColor2%, %mMir2%
			GUI, ADD,TEXT,c%rColor2%, %mMir3%
			GUI, ADD,TEXT,c%rColor2%, %mMir4%
			GUI, ADD,TEXT,c%rColor2%, %mMir5%
	GUI, ADD,TEXT,cBlue,==============================================================================================
	WinSet, TransColor, %CustomColor3% 180
	Gui, Show, x0 y0 NoActivate, window. 
	}
	Else
	Gui Destroy
		return
;===================================================================================
			Help:
	State3:=!State3
	If state3
	{
	CustomColor3 = EEAA99
	Gui +LastFound +AlwaysOnTop -Caption +ToolWindow 
	Gui, Color, black
	Gui, Font, s8
	Gui, Font, c0x000000
	Gui, Font, w680
	Gui, Font,, verdana
			GUI, ADD,TEXT,c%rColor2%, .угон .нарко .фрапс .вин .тикет Розыск-.кпк
			GUI, ADD,TEXT,c%rColor2%, Проверка личности: .бдкпк | .отпечатки | .кровь (в лаборатории) 
			GUI, ADD,TEXT,c%rColor2%, .адвокат .прокурор .взятка .обыск .юр .кпз 
			GUI, ADD,TEXT,c%rColor2%, .пут .пул .спавн .лиц .волна .госнабор
			GUI, ADD,TEXT,c%rColor2%, .радио .визитка .кам .скам1/2 
			GUI, ADD,TEXT,cRed, Закон о гос.службе | Требовать удостоверение - ст. 14.2 
			GUI, ADD,TEXT,cRed, ПК | Опознание личности - ст. 15 | Отойти на 10 метров - ст. 20 пункт 2
			GUI, ADD,TEXT,cRed, ПК | Обыск при проходе на закрытую территорию(холл) - ст. 23 пункт 2.1 
			GUI, ADD,TEXT,c%rColor2%, АК | Ложный вызов - ст. 6.3(5000$) Оск - ст. 7.1(5000$)
			GUI, ADD,TEXT,c%rColor2%, АК | Мелкое хулиг. - ст. 9.1(10000$) Стрельба - ст. 10(5000$)
			GUI, ADD,TEXT,c%rColor2%, АК | Хулиганство(Оск. гос. сотрудника) - ст. 9.2(20000$)
			GUI, ADD,TEXT,cGreen, ДК | Остановка Авто - ст. 7(3000$) Выйти из машины - ст. 17 и 71
			GUI, ADD,TEXT,cGreen, ДК | Предъяв.лицензию - ст.6(3000$) Основания для траф.стопа - ст. 70
			GUI, ADD,TEXT,cGreen, ДК | Нет номера/грязный номер - ст. 66(15000$ и эвак.авто)
			GUI, ADD,TEXT,cGreen, Текст при остановке авто - Я имею право остановить вас на основании
			GUI, ADD,TEXT,cGreen, 70 статьи дк, также требую выйти из машины на основании 17 и 71 статьи дк
			GUI, ADD,TEXT,cGreen, и показать лицензии на основании 6 статьи дк. Это законные требования.
			GUI, ADD,TEXT,c%rColor1%, Выход под залог запрещен: 6.3,6.4,12.1,12.2,12.3,12.12,12.14,13.6, 
			GUI, ADD,TEXT,c%rColor1%, 13.8, 14.1,14.2,16.2,16.17,17.1 ук. | Более чем по 3-ем статьям.
			GUI, ADD,TEXT,c%rColor1%, Судимость выдается за 5 звезд. 
			GUI, ADD,TEXT,c%rColor1%, НАНЕСЕНИЕ ТЕЛ.ПОВРЕЖДЕНИЙ/УБИЙСТВО - 6.1/(CR)6.2  4/5 звезд
			GUI, ADD,TEXT,c%rColor1%, УГОН АВТО - 10.7  3 звезды
			GUI, ADD,TEXT,c%rColor1%, УМЫШЛЕННОЕ ПОВРЕЖДЕНИЕ ЧУЖОГО ИМУЩ. - 10.8  3 звезды
			GUI, ADD,TEXT,c%rColor1%, УМЫШЛЕННОЕ ПОВРЕЖДЕНИЕ ГОС.ИМУЩ. - 10.8.1  3 звезды	
			GUI, ADD,TEXT,c%rColor1%, ЗАКРЫТЫЙ ОБЪЕКТ - 12.7  3 звезды
			GUI, ADD,TEXT,c%rColor1%, НОШЕНИЕ ОРУЖИЯ - 12.8  4 звезды 
			GUI, ADD,TEXT,c%rColor1%, НАРКОТА - 13.1/13.2/(CR)13.3 (3,7,20 грамм) - 2/4/5 звезды
			GUI, ADD,TEXT,c%rColor1%, 1 пак. - 1 грамм | до 3-х грамм(вкл.) - легально и изымается без статьи.
			GUI, ADD,TEXT,c%rColor1%, ДАЧА ВЗЯТКИ - 15.5  3 звезды
			GUI, ADD,TEXT,c%rColor1%, ПРОВОКАЦИЯ - 15.8  2 звезды
			GUI, ADD,TEXT,c%rColor1%, ЧЕЛОВЕК НАХОДИТСЯ В РОЗЫСКЕ - 16.16  1 звезда
			GUI, ADD,TEXT,c%rColor1%, (CR)ПОСЯГАТЕЛЬСТВО НА ЖИЗНЬ СОТРУДНИКА - 17.1  5 звезд
			GUI, ADD,TEXT,c%rColor1%, ТЕЛ.ПОВРЕЖДЕНИЯ СОТРУДНИКУ - 17.2  3 звезды
			GUI, ADD,TEXT,c%rColor1%, НЕПОДЧИНЕНИЕ ТРЕБОВАНИЯМ - 17.5  3 звезды 
			GUI, ADD,TEXT,c%rColor1%, ОТКАЗ ОТ ОПЛАТЫ ШТРАФА - 17.6  3 звезды
			GUI, ADD,TEXT,c%rColor1%, УКРЫВАТЕЛЬСТВО - 17.7  2 звезды
			GUI, ADD,TEXT,c%rColor1%, ПОМЕХА ПРИ ЗАДЕРЖАНИИ - 17.8  2 звезды
			GUI, ADD,TEXT,c%rColor1%, ПОБЕГ ПРИ ЗАДЕРЖАНИИ - 17.10  4 звезды
     	WinSet, TransColor, %CustomColor3% 200
	Gui, Show, x1385 y56 NoActivate, window. 
	}
	Else
	Gui Destroy
		return
;===================================================================================
------------------------------------------------------------------------------------------------------------
                                                -----Боксы-----
------------------------------------------------------------------------------------------------------------
;===================================================================================
			Manu:
	MsgBox, 0, Описание, О софте:`nСофт обширен и универсален для работы во всех гос структурах.`n`nНемного о кнопках:`n СОКРАЩЕНИЯ - Содержит в себе расшифровку всех сокращений.`n КОМАНДЫ - Содержит все доступные команды игрокам на сервере.`n БИНДЫ - Содержит описание всех хоткеев, расположенных на основном GUI.`n МИРАНДА - Тут идёт настройка для посказки, просто меняете текст на который нужен.`n BADGE - Отыгровка Вашего бейджа/нашивки/шеврона, не имеет значения, пишете отыгровку без "/do" и без точки в конце.`n VISITING CARD - Ваша визитка. Содержит номер/почту/отдел.`n SAVE - Нужна для сохранения всех параметров, выставленных в главном меню.`n`nУдаление горячих клавишь происходит на Backspace, после создания "бинда" необходимо сохранение, как и после его снятия!`n`nЗакрывать скрип только на кнопку "EXIT", в противном случае он уйдёт в фоновые процессы! `nВо всех случаях Ctrl + F10 завершит работу скрипта, а Ctrl + F9 его перезапустит!`n`n Создатель - 𝐤𝐞𝐥𝐥𝐲`n`n Реконструктор/Воссоздатель - 𝐃𝐢𝐬𝐜𝐨𝐫𝐝: 𝐲𝐚𝐬𝐡𝐢𝐳𝐚.𝐬.𝐛𝐞𝐤𝐨𝐧𝐨𝐦`n                                                       𝐘𝐨𝐮𝐓𝐮𝐛𝐞: 𝐊𝐢𝐜𝐤𝐋𝐨𝐬`n`n Создание биндера - ⋘𝟏𝟑.𝟎𝟕.𝟐𝟎𝟐𝟏⋙`n`n Дата воссоздания -⋘𝟏𝟒.𝟏𝟐.𝟐𝟎𝟐𝟐⋙`n`n Последнее обновление - ⋘𝟎𝟗.𝟎𝟑.𝟐𝟎𝟐𝟒⋙
	return
;===================================================================================
			Info1:
	MsgBox, 0, Основные команды в чат, .тикет - написать тикет и эвакуировать авто.`n`n .отпечатки - отыгровка распознавания личности по отпечаткам пальцев.`n`n .кровь - отыгровка распознавания человека по анализу крови(брать в лаборатории).`n`n .юр - запрос на нарушение юрисдикции.`n`n .гос - обращение в рацию департамента ко всем гос.структурам "/dep to all:" и по аналогии к остальным - .пд .фиб .сд .санг .гов .емс .вн.`n`n .кпк - выдать розыск.`n`n .бдкпк - когда нет документов, идет отыгровка, как вы делаете фото, после чего в базе данных чекаете человека.`n`n .кпз - отыгровка, как вы заводите человека в кпз.`n`n .нарко - проверка неизвестного вещества. проще говоря док-ва, что у человека наркота, а не чай с чабрецом.`n`n .взятка - процесс отыгровки в /do перед дачей взятки. (Проверка на видеофиксацию)`n`n .адвокат - вызов адвоката в кпз LSPD.`n`n .прокурор - вызов прокурора в кпз LSPD.`n`n .угон - проверка на угон авто. (отыгровка проверки номеров в базе данных) *Если че, то отыгровка сделана мною так, что человек в любом случае не сможет`n отыграть наподобие: "Что написано в ориентировке?" И даже если отыграл, то на это можно забить. Это - некорректная отыгровка в "do" считается.*`n`n .вин - отыгровка проверки vin-номера авто в базе данных.(Нужно стоять около двери машины с водительской стороны.)`n`n .пут [ID] - засунуть человека в машину.`n`n .пул [ID] - вытащить человека из машины.`n`n .радио - включить радио по рп. (Для того, чтобы слушать музыку через гч)`n`n .спавн - спавн тачек во фракции (15 секунд).`n`n .фрапс - рп отыгровка, как вы сохраняете запись с боди камеры, вставляете флешку в пк и отправляете на почту. `n`n .лиц - начало выдачи лицензий.`n`n .кам - отыгровка закрепления боди камеры.`n`n .обыск - отыгровка обыска человека напротив.`n`n .визитка - отыгровка вашей визитки. Редактировать ее можно в GUI "PERSONALIZATION"`n`n .скам1 -> .скам2 - последовательность действий, которые содержат в себе отыгровки, как вы кладете документы в бардачок машины, а далее, что при вас их нет.`n`n .волна - отыгровка, которая пишет в рацию департамента о том, что вы занимаете волну на определенное время.`n`n .госнабор - отыгровка, которая пишет в рацию департамента, что вы заняли гос.волну и потом скрипт отправляет само объявление в gnews.`n`n`nЕсть еще множество команд в этом биндере, но я выделил самые основные. Остальные можно поискать в биндере самому(тому, кто понимает о чем я).`n`n`n!!!СНАЧАЛА ПОТРЕНЕРУЙТЕСЬ С КОМАНДАМИ. ЧТО, ГДЕ, КАК ОТЫГРЫВАЕТСЯ И КАК ПРАВИЛЬНО ИХ ПРИМЕНЯТЬ!!! 
		return
;===================================================================================
			Com:
	MsgBox, 0, Сокращения популярных команд,- .с - Быстрая просись /c(Семейный чат IC).`n- .си - Быстрая просись /cb(Семейный чат OOC).`n- .мут - Быстрая пропись /vmute(Мут игрока).`n- .ы - Быстрая пропись /s(Крик).`n- .и - Быстрая пропись /b(OOC чат).`n- .а - Быстрая пропись /f(IC чат).`n- .аи - Быстрая пропись /fb(OOC чат).`n- .ц - Быстрая пропись /w(Шёпот).`n- .вз - Пропись команды(/wnews WN).`n- .вч - Пропись команды(/adv WN).`n- .су - Быстрая пропись /su(Выдача звёзд).`n- .ев - Быстрая пропись /event(Телепорт на МП).`n- .кл - Быстрая пропись /clearchat.`n- .ьу - Быстрая пропись /me.`n- .вщ - Быстрая пропись /do.`n- .куз - Быстрая пропись /report.`n- /rep - Быстрая пропись /report.
		return
;===================================================================================
			HotKey:
	MsgBox, 0, HotKey's,- Relog - Перезапуск скрипта. *Можно использовать в роле "Остановки РП". Я делаю именно так*`n- CODE-0 - Офицер ранен/убит.`n- CODE-7 - Код о скоплении вооруженных лиц.`n- CODE-6 - Код о массовых беспорядках.`n- Badge - Отыгровка нашивки, на груди.`n- Badge(Q) - Вопрос в /do про нашивки игрока.`n- Miranda - Окошечко в левом углу с текстом.`n- Armor - Помогает быстро одеть броник, но его центр должен быть в пятом ряду и четвёртом столбце, Вашего инвентаря.`n- Памятка- Небольшие полезные подсказки от меня.
		return
;===================================================================================
